{
  "nodes": [
    {
      "op": "null", 
      "name": "X", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_divide_round_add_clip_cast_nn_pad_cast_subtract", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "d1b84bd9258e6d9c", 
        "func_name": "tvmgen_default_fused_divide_round_add_clip_cast_nn_pad_cast_subtract"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "718607a9c4dcae97", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "73cde9514be6ce4f", 
        "func_name": "tvmgen_default_fused_nn_pad_cast"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "5f82262bf998ed89", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "bc1a7c1755d9165a", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "65501307acee88e8", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_1"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "ccea2d5c7122ed2c", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "9eccde7aa8ab49d8", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_cast", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "b53eb3a793e95ace", 
        "func_name": "tvmgen_default_fused_cast_subtract"
      }, 
      "inputs": [
        [
          20, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "ae5a08d89cb11c42", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "aa69ce8881f90702", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_2"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "82d1bdc31d2709d3", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "7", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "99344ab1bab0c746", 
        "func_name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3_", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "b53eb3a793e95ace", 
        "func_name": "tvmgen_default_fused_cast_subtract"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "59d1951d6b77fba7", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_2_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "aa69ce8881f90702", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_2"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "c0247bf934011de2", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "7", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "48afcebd2fc2762f", 
        "func_name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "b53eb3a793e95ace", 
        "func_name": "tvmgen_default_fused_cast_subtract"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "5d72191d7df6f884", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_4", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_2_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "aa69ce8881f90702", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_2"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "a60bf36f95082b90", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_4", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "7", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "81df652254f99de9", 
        "func_name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "b53eb3a793e95ace", 
        "func_name": "tvmgen_default_fused_cast_subtract"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "e087ea040f0dd596", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_5", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_2_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "aa69ce8881f90702", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_2"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "36d2d675b91895e7", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_5", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ], 
        [
          73, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__9d0be5571e6d9389_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "7", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "7032ee0c10d5b3cb", 
        "func_name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__9d0be5571e6d9389_", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "95e10edfe6ec0df2", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_6", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "8ee7a7f64d345ae4", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_3"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "f90d82f226c30c89", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_6", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "c7d3dbdc59bb915f", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_cast_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          86, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_1_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "eef00c0c64be845d", 
        "func_name": "tvmgen_default_fused_cast_subtract_1"
      }, 
      "inputs": [
        [
          90, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "7fa2bd5e1d2a10d1", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_7", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          93, 
          0, 
          0
        ], 
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "f35107b750f43c1e", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_4"
      }, 
      "inputs": [
        [
          96, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p63", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "6d65f1ad53bebad4", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_7", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ], 
        [
          98, 
          0, 
          0
        ], 
        [
          99, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p64", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p65", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "7", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "b50b2e47b591f676", 
        "func_name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          90, 
          0, 
          0
        ], 
        [
          91, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ], 
        [
          101, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p66", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p67", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_1_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "eef00c0c64be845d", 
        "func_name": "tvmgen_default_fused_cast_subtract_1"
      }, 
      "inputs": [
        [
          103, 
          0, 
          0
        ], 
        [
          105, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p68", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p69", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "a156d17d52776f74", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_8", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          106, 
          0, 
          0
        ], 
        [
          107, 
          0, 
          0
        ], 
        [
          108, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_4_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "f35107b750f43c1e", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_4"
      }, 
      "inputs": [
        [
          109, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p70", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p71", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "5e7ae1a3ce5e541b", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_8", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          110, 
          0, 
          0
        ], 
        [
          111, 
          0, 
          0
        ], 
        [
          112, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p72", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p73", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p74", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "8c72d5363e3b15c3", 
        "func_name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__4", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          103, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ], 
        [
          113, 
          0, 
          0
        ], 
        [
          114, 
          0, 
          0
        ], 
        [
          115, 
          0, 
          0
        ], 
        [
          116, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p75", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p76", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_1_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "eef00c0c64be845d", 
        "func_name": "tvmgen_default_fused_cast_subtract_1"
      }, 
      "inputs": [
        [
          117, 
          0, 
          0
        ], 
        [
          119, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p77", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p78", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "e048a235e216c154", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_9", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          120, 
          0, 
          0
        ], 
        [
          121, 
          0, 
          0
        ], 
        [
          122, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_4_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "f35107b750f43c1e", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_4"
      }, 
      "inputs": [
        [
          123, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p79", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p80", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "dcaa5b39732ba434", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_9", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          124, 
          0, 
          0
        ], 
        [
          125, 
          0, 
          0
        ], 
        [
          126, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p81", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p82", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p83", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p84", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "8", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "abec233c743c76d0", 
        "func_name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__5", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          117, 
          0, 
          0
        ], 
        [
          118, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ], 
        [
          127, 
          0, 
          0
        ], 
        [
          128, 
          0, 
          0
        ], 
        [
          129, 
          0, 
          0
        ], 
        [
          130, 
          0, 
          0
        ], 
        [
          131, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_1_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "eef00c0c64be845d", 
        "func_name": "tvmgen_default_fused_cast_subtract_1"
      }, 
      "inputs": [
        [
          132, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p85", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p86", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "5a40455d78ca71c8", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_10", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          133, 
          0, 
          0
        ], 
        [
          134, 
          0, 
          0
        ], 
        [
          135, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_4_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "f35107b750f43c1e", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_4"
      }, 
      "inputs": [
        [
          136, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p87", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p88", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "f396992f56d268e1", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_10", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          137, 
          0, 
          0
        ], 
        [
          138, 
          0, 
          0
        ], 
        [
          139, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p89", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p90", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "7", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "2b872d214b26846f", 
        "func_name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__6", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          132, 
          0, 
          0
        ], 
        [
          91, 
          0, 
          0
        ], 
        [
          140, 
          0, 
          0
        ], 
        [
          141, 
          0, 
          0
        ], 
        [
          142, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p91", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p92", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_1_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "eef00c0c64be845d", 
        "func_name": "tvmgen_default_fused_cast_subtract_1"
      }, 
      "inputs": [
        [
          143, 
          0, 
          0
        ], 
        [
          145, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p93", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p94", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "256ccae66a631aea", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_11", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          146, 
          0, 
          0
        ], 
        [
          147, 
          0, 
          0
        ], 
        [
          148, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_4_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "f35107b750f43c1e", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_4"
      }, 
      "inputs": [
        [
          149, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p95", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p96", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "a2d07ceb504775d4", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_11", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          150, 
          0, 
          0
        ], 
        [
          151, 
          0, 
          0
        ], 
        [
          152, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p97", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p98", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "7", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "c18ad361d85f3954", 
        "func_name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__d382885441b4bed3__7", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          143, 
          0, 
          0
        ], 
        [
          144, 
          0, 
          0
        ], 
        [
          153, 
          0, 
          0
        ], 
        [
          154, 
          0, 
          0
        ], 
        [
          155, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p99", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p100", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_1_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "eef00c0c64be845d", 
        "func_name": "tvmgen_default_fused_cast_subtract_1"
      }, 
      "inputs": [
        [
          156, 
          0, 
          0
        ], 
        [
          158, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p101", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p102", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "4fd3caa55cd8b355", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_12", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          159, 
          0, 
          0
        ], 
        [
          160, 
          0, 
          0
        ], 
        [
          161, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_4_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "f35107b750f43c1e", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_4"
      }, 
      "inputs": [
        [
          162, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p103", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p104", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "31515a780a40123f", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_12", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          163, 
          0, 
          0
        ], 
        [
          164, 
          0, 
          0
        ], 
        [
          165, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p105", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p106", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p107", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__9d0be5571e6d9389__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "9", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "9b64b28cb61ec9ea", 
        "func_name": "tvmgen_default_fused_cast_subtract_fixed_point_multiply_add_nn_conv2d_add_fixed_point_multiply__9d0be5571e6d9389__1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          156, 
          0, 
          0
        ], 
        [
          157, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          166, 
          0, 
          0
        ], 
        [
          167, 
          0, 
          0
        ], 
        [
          168, 
          0, 
          0
        ], 
        [
          130, 
          0, 
          0
        ], 
        [
          131, 
          0, 
          0
        ], 
        [
          169, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p108", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p109", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_13", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "8657298f93f857da", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_13", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          170, 
          0, 
          0
        ], 
        [
          171, 
          0, 
          0
        ], 
        [
          172, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "78dcf0d5e247cd79", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_5"
      }, 
      "inputs": [
        [
          173, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p110", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p111", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_13", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "7fd4e3903253d6a3", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_13", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          174, 
          0, 
          0
        ], 
        [
          175, 
          0, 
          0
        ], 
        [
          176, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p112", 
