{
  "nodes": [
    {
      "op": "null", 
      "name": "img", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_divide_round_add_clip_cast_nn_pad_cast_subtract", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "1d08457a52217591", 
        "func_name": "tvmgen_default_fused_divide_round_add_clip_cast_nn_pad_cast_subtract"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "2ae47991cfa84ce1", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "2e1faecf86a116b5", 
        "func_name": "tvmgen_default_fused_nn_pad_cast"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "c435edaec0f92f97", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_multiply_divide_round_clip_ca_5a7acb3e4c58ac5c_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "573874088fcf4799", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_multiply_divide_round_clip_ca_5a7acb3e4c58ac5c_", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "2e1faecf86a116b5", 
        "func_name": "tvmgen_default_fused_nn_pad_cast"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "33805a1b6fa00833", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "e9a4b4cc4c6a016a", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_1_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0e79858e286d368f", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_1"
      }, 
      "inputs": [
        [
          19, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "3ff4bab2e7b6b5ac", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_multiply_divide_round_clip_ca_5a7acb3e4c58ac5c__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "0ed195dc3944902c", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_multiply_divide_round_clip_ca_5a7acb3e4c58ac5c__1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_1_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "0e79858e286d368f", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_1"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "d09f3379a0c9f30a", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "949fc9c766d40ce8", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "cb663ce1048c7dac", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_2"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "0e507b227deeef76", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_4", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "cef7aa6cabb7222f", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_2_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "cb663ce1048c7dac", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_2"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "5b532a17183d9dae", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_5", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_multiply_divide_round_clip_ca_5a7acb3e4c58ac5c__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "5826c37054b41bab", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_multiply_divide_round_clip_ca_5a7acb3e4c58ac5c__2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "6597ae38229a61d3", 
        "func_name": "tvmgen_default_fused_cast"
      }, 
      "inputs": [
        [
          47, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_2_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "cb663ce1048c7dac", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_2"
      }, 
      "inputs": [
        [
          47, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "15dfe1bfe6d3f468", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_6", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "4b5163c541601119", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_4", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "ffb0124efc957aed", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_3"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "592a0c872005f42f", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_7", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_multiply_divide_round_clip_ca_5a7acb3e4c58ac5c__3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "f6a9c65bb4c7318f", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_multiply_divide_round_clip_ca_5a7acb3e4c58ac5c__3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "b4faf7a1f9b9a1a3", 
        "func_name": "tvmgen_default_fused_cast_1"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_3_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "ffb0124efc957aed", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_3"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "ed74c9905f84fddf", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_8", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW8o", 
        "hash": "eff65ef12b7cc133", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_5", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "81e05eadeacdf244", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_4"
      }, 
      "inputs": [
        [
          76, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "a68d8ba98ae37fff", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_9", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW8o", 
        "hash": "3d2c884e1953d88b", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_6", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ], 
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_4_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "81e05eadeacdf244", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_4"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "4b52ad82fe32d15d", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_10", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW8o", 
        "hash": "a59903e7a8cbe1b9", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_7", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_4_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "81e05eadeacdf244", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_4"
      }, 
      "inputs": [
        [
          90, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "034a6b73d6afe356", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_11", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ], 
        [
          93, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW8o", 
        "hash": "dd30662ba2201867", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_8", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_4_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "81e05eadeacdf244", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_4"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "31817b6b9a057325", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_12", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          98, 
          0, 
          0
        ], 
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW8o", 
        "hash": "917b409942b33b14", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_9", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          101, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ], 
        [
          103, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_4_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "81e05eadeacdf244", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_4"
      }, 
      "inputs": [
        [
          104, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_13", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "507989ac125b2f2f", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_13", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          105, 
          0, 
          0
        ], 
        [
          106, 
          0, 
          0
        ], 
        [
          107, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p63", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p64", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_multiply_divide_round_clip_ca_5ed5bc40b1d2fa8b_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW8o", 
        "hash": "e87ffbac9cf7c663", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_multiply_divide_round_clip_ca_5ed5bc40b1d2fa8b_", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          108, 
          0, 
          0
        ], 
        [
          109, 
          0, 
          0
        ], 
        [
          110, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p65", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p66", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "a8620f6d995cb93c", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          111, 
          0, 
          0
        ], 
        [
          112, 
          0, 
          0
        ], 
        [
          113, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_image_resize2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_image_resize2d", 
        "hash": "500ebd6f950853d1", 
        "layout": "NCHW"
      }, 
      "inputs": [
        [
          114, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "e65f45624bace5b9", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_add", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ], 
        [
          115, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_image_resize2d_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_image_resize2d_1", 
        "hash": "c84c7f0a5d66552c", 
        "layout": "NCHW"
      }, 
      "inputs": [
        [
          116, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_add_div_a9dbf81a12cae1ce_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "e2d06239ca7d5490", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_add_div_a9dbf81a12cae1ce_", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ], 
        [
          117, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p67", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_subtract", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9bd4edef10925d1f", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_subtract"
      }, 
      "inputs": [
        [
          118, 
          0, 
          0
        ], 
        [
          119, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p68", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p69", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_divide__15cf6f82c40a2b48_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "8e233192bf234a96", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_divide__15cf6f82c40a2b48_", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          120, 
          0, 
          0
        ], 
        [
          121, 
          0, 
          0
        ], 
        [
          122, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p70", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_subtract_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "fd3b9e3d32be802e", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_subtract_1"
      }, 
      "inputs": [
        [
          123, 
          0, 
          0
        ], 
        [
          124, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p71", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p72", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_14", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "0f91dc9478023ee3", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_14", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          125, 
          0, 
          0
        ], 
        [
          126, 
          0, 
          0
        ], 
        [
          127, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p73", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p74", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "1de725d44663925c", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_10", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          128, 
          0, 
          0
        ], 
        [
          129, 
          0, 
          0
        ], 
        [
          130, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "9aa9e1a7ad444ca4", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_5"
      }, 
      "inputs": [
        [
          131, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p75", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p76", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_15", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "556303d9215d7bda", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_15", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          132, 
          0, 
          0
        ], 
        [
          133, 
          0, 
          0
        ], 
        [
          134, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p77", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p78", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "9da069b1af09a574", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_11", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          135, 
          0, 
          0
        ], 
        [
          136, 
          0, 
          0
        ], 
        [
          137, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_5_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "9aa9e1a7ad444ca4", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_5"
      }, 
      "inputs": [
        [
          138, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p79", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p80", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "out_layout": "", 
        "kernel_layout": "OIHW2o", 
        "hash": "c666e2a967cf9afc", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_1", 
        "data_layout": "NCHW", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          139, 
          0, 
          0
        ], 
        [
          140, 
          0, 
          0
        ], 
        [
          141, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_transpose_reshape_sigmoid", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "f8544625f1fbf435", 
        "func_name": "tvmgen_default_fused_transpose_reshape_sigmoid"
      }, 
      "inputs": [
        [
          142, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p81", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_divide_round_add_clip_cast_nn_pad_cast_subtract_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "7f790db93191392a", 
        "func_name": "tvmgen_default_fused_divide_round_add_clip_cast_nn_pad_cast_subtract_1"
      }, 
      "inputs": [
        [
          116, 
          0, 
          0
        ], 
        [
          144, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p82", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p83", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p84", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p85", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "c22ff4fb87c5489a", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          125, 
          0, 
          0
        ], 
        [
          148, 
          0, 
          0
        ], 
        [
          149, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_add_div_a9dbf81a12cae1ce__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "3353d9598630bf6a", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_add_div_a9dbf81a12cae1ce__1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          145, 
          0, 
          0
        ], 
        [
          146, 
          0, 
          0
        ], 
        [
          147, 
          0, 
          0
        ], 
        [
          150, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p86", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_subtract_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "0d66a94279bd5fbf", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_subtract_2"
      }, 
      "inputs": [
        [
          151, 
          0, 
          0
        ], 
        [
          152, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p87", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p88", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_divide__15cf6f82c40a2b48__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "025c75ad69a1e760", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_add_clip_subtract_cast_multiply_divide__15cf6f82c40a2b48__1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          153, 
          0, 
          0
        ], 
        [
          154, 
          0, 
          0
        ], 
        [
          155, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p89", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_subtract_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "7e912fd65e981ca8", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_subtract_3"
      }, 
      "inputs": [
        [
          156, 
          0, 
          0
        ], 
        [
          157, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p90", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p91", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_16", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "8515e2b21313d13a", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_16", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          158, 
          0, 
          0
        ], 
        [
          159, 
          0, 
          0
        ], 
        [
          160, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p92", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p93", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "a3fa2ba44c298beb", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_12", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          161, 
          0, 
          0
        ], 
        [
          162, 
          0, 
          0
        ], 
        [
          163, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "d028912e4c5263ab", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_6"
      }, 
      "inputs": [
        [
          164, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p94", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p95", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_17", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "55b14bc7bffaf16a", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_cast_17", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          165, 
          0, 
          0
        ], 
        [
          166, 
          0, 
          0
        ], 
