{
  "nodes": [
    {
      "op": "null", 
      "name": "X", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_divide_round_add_clip_cast_nn_pad_cast_add_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "a3caf2d429437cc9", 
        "func_name": "tvmgen_default_fused_divide_round_add_clip_cast_nn_pad_cast_add_cast"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "fdf478924519eb8d", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "bf8956a253df209a", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "bf1580036f3c5cc8", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "196c5ab4a1ab17bc", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "c5699c6c60ecdcbf", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_1"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "f796e5f6cfe401f8", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_add_clip", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "bc74c6847f8869d1", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_add_clip", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "70f8e6e795949416", 
        "func_name": "tvmgen_default_fused_add_cast"
      }, 
      "inputs": [
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "7a40ce11876bb81b", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_fixed_point_multiply_clip_cast_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "84e46dbf69593140", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_2"
      }, 
      "inputs": [
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "c99029b7e127ae6e", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "8", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "9a96818146c55dc1", 
        "func_name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd_", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "70f8e6e795949416", 
        "func_name": "tvmgen_default_fused_add_cast"
      }, 
      "inputs": [
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "03e65e68c9852629", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_2_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "84e46dbf69593140", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_2"
      }, 
      "inputs": [
        [
          45, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "91f25ebe9a554c1f", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "8", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "53d68a2a29b63b57", 
        "func_name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          39, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "70f8e6e795949416", 
        "func_name": "tvmgen_default_fused_add_cast"
      }, 
      "inputs": [
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "50c9872a26d4d584", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_2_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "84e46dbf69593140", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_2"
      }, 
      "inputs": [
        [
          62, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "e077e3a764b8423a", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_4", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "8", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "291ade7ec5f85fe9", 
        "func_name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "70f8e6e795949416", 
        "func_name": "tvmgen_default_fused_add_cast"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "12c8803c6ee0cf61", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_2_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "84e46dbf69593140", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_2"
      }, 
      "inputs": [
        [
          79, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "be90e698f9d56048", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_5", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ], 
        [
          82, 
          0, 
          0
        ], 
        [
          83, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_22909cbe1f6014d1_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "7", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW4o", 
        "hash": "7df2f7e3c45bbdb0", 
        "func_name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_22909cbe1f6014d1_", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p63", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "3d7e0db5fe476364", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_4", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          89, 
          0, 
          0
        ], 
        [
          90, 
          0, 
          0
        ], 
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "237c2af9c0aad1bb", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_3"
      }, 
      "inputs": [
        [
          93, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p64", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p65", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p66", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "3bb10b328b66b7de", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_6", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ], 
        [
          97, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p67", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p68", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p69", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p70", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_add_clip_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "43dad23c4bd644db", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_add_clip_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          98, 
          0, 
          0
        ], 
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ], 
        [
          101, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p71", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_cast_1_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "207d335668731a53", 
        "func_name": "tvmgen_default_fused_add_cast_1"
      }, 
      "inputs": [
        [
          103, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p72", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p73", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p74", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "e28c8ee37a8f1ed3", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_5", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          105, 
          0, 
          0
        ], 
        [
          106, 
          0, 
          0
        ], 
        [
          107, 
          0, 
          0
        ], 
        [
          108, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "750ca69ef1ccc217", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_4"
      }, 
      "inputs": [
        [
          109, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p75", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p76", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p77", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "481d08c9f7e8411a", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_7", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          110, 
          0, 
          0
        ], 
        [
          111, 
          0, 
          0
        ], 
        [
          112, 
          0, 
          0
        ], 
        [
          113, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p78", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p79", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p80", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "8", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "2a7b6196355314e1", 
        "func_name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          103, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ], 
        [
          114, 
          0, 
          0
        ], 
        [
          115, 
          0, 
          0
        ], 
        [
          116, 
          0, 
          0
        ], 
        [
          117, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p81", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_cast_1_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "207d335668731a53", 
        "func_name": "tvmgen_default_fused_add_cast_1"
      }, 
      "inputs": [
        [
          118, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p82", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p83", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p84", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "b222fd5ed01dfbc1", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_6", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          120, 
          0, 
          0
        ], 
        [
          121, 
          0, 
          0
        ], 
        [
          122, 
          0, 
          0
        ], 
        [
          123, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_4_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "750ca69ef1ccc217", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_4"
      }, 
      "inputs": [
        [
          124, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p85", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p86", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p87", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "484145ac489dd095", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_8", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          125, 
          0, 
          0
        ], 
        [
          126, 
          0, 
          0
        ], 
        [
          127, 
          0, 
          0
        ], 
        [
          128, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p88", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p89", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p90", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p91", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "7", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "c5caf15bfa4362b2", 
        "func_name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__4", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          118, 
          0, 
          0
        ], 
        [
          119, 
          0, 
          0
        ], 
        [
          129, 
          0, 
          0
        ], 
        [
          130, 
          0, 
          0
        ], 
        [
          131, 
          0, 
          0
        ], 
        [
          132, 
          0, 
          0
        ], 
        [
          133, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p92", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_cast_1_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "207d335668731a53", 
        "func_name": "tvmgen_default_fused_add_cast_1"
      }, 
      "inputs": [
        [
          134, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p93", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p94", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p95", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "9b72fa04bfb1c5e3", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_7", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          136, 
          0, 
          0
        ], 
        [
          137, 
          0, 
          0
        ], 
        [
          138, 
          0, 
          0
        ], 
        [
          139, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_4_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "750ca69ef1ccc217", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_4"
      }, 
      "inputs": [
        [
          140, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p96", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p97", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p98", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "05c1ad6fe0ee684a", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_9", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          141, 
          0, 
          0
        ], 
        [
          142, 
          0, 
          0
        ], 
        [
          143, 
          0, 
          0
        ], 
        [
          144, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p99", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p100", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p101", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p102", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p103", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "9", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "14e71186f49fb19c", 
        "func_name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__5", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          134, 
          0, 
          0
        ], 
        [
          135, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ], 
        [
          145, 
          0, 
          0
        ], 
        [
          146, 
          0, 
          0
        ], 
        [
          147, 
          0, 
          0
        ], 
        [
          148, 
          0, 
          0
        ], 
        [
          149, 
          0, 
          0
        ], 
        [
          150, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_cast_1_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "207d335668731a53", 
        "func_name": "tvmgen_default_fused_add_cast_1"
      }, 
      "inputs": [
        [
          151, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p104", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p105", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p106", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "43692d204837b10c", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_8", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          152, 
          0, 
          0
        ], 
        [
          153, 
          0, 
          0
        ], 
        [
          154, 
          0, 
          0
        ], 
        [
          155, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_4_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "750ca69ef1ccc217", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_4"
      }, 
      "inputs": [
        [
          156, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p107", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p108", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p109", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "ca7210da52e4cf30", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_10", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          157, 
          0, 
          0
        ], 
        [
          158, 
          0, 
          0
        ], 
        [
          159, 
          0, 
          0
        ], 
        [
          160, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p110", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p111", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p112", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "8", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "c35e1a08b2c6a15c", 
        "func_name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__6", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          151, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ], 
        [
          161, 
          0, 
          0
        ], 
        [
          162, 
          0, 
          0
        ], 
        [
          163, 
          0, 
          0
        ], 
        [
          164, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p113", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_cast_1_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "207d335668731a53", 
        "func_name": "tvmgen_default_fused_add_cast_1"
      }, 
      "inputs": [
        [
          165, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p114", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p115", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p116", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "1573cb829f5e65d5", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_9", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          167, 
          0, 
          0
        ], 
        [
          168, 
          0, 
          0
        ], 
        [
          169, 
          0, 
          0
        ], 
        [
          170, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_4_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "750ca69ef1ccc217", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_4"
      }, 
      "inputs": [
        [
          171, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p117", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p118", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p119", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "a04dbef8fe9af551", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_11", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          172, 
          0, 
          0
        ], 
        [
          173, 
          0, 
          0
        ], 
        [
          174, 
          0, 
          0
        ], 
        [
          175, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p120", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p121", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p122", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "8", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "71b25adbbfd000b2", 
        "func_name": "tvmgen_default_fused_subtract_fixed_point_multiply_add_nn_conv2d_subtract_add_fixed_point_multi_d0601ae0cfbc43bd__7", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          165, 
          0, 
          0
        ], 
        [
          166, 
          0, 
          0
        ], 
        [
          176, 
          0, 
          0
        ], 
        [
          177, 
          0, 
          0
        ], 
        [
          178, 
          0, 
          0
        ], 
        [
          179, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p123", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_cast_1_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "207d335668731a53", 
        "func_name": "tvmgen_default_fused_add_cast_1"
      }, 
      "inputs": [
        [
          180, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p124", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p125", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p126", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW16o", 
        "hash": "334f656ec03fd131", 
        "func_name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_cast_10", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          182, 
          0, 
          0
        ], 
        [
          183, 
          0, 
          0
        ], 
        [
          184, 
          0, 
          0
        ], 
        [
          185, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_cast_add_cast_4_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "750ca69ef1ccc217", 
        "func_name": "tvmgen_default_fused_nn_pad_cast_add_cast_4"
      }, 
      "inputs": [
        [
          186, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p127", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p128", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p129", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_subtract_add_fixed_point_multiply_clip_add_cast_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "data_layout": "NCHW", 
        "kernel_layout": "OIHW", 
        "hash": "a0e2f8f29dd81aa5", 
